import matplotlib.pyplot as plt

plt.xlabel('Количество полигонов') #Подпись для оси х
plt.ylabel('Время, мкс') #Подпись для оси y
plt.title('График зависимости времени работы от количества полигонов и размера фигуры')

x = [10, 50, 100, 200]
y = [1135, 1647, 3079, 4567]

plt.plot(x, y, marker='o', label="Фигура 20*200")

x = [10, 50, 100, 200]
y = [3245, 4598, 5248, 7136]

plt.plot(x, y, marker='v', label="Фигура 50*200")

x = [10, 50, 100, 200]
y = [5783, 6690, 8821, 13582]

plt.plot(x, y, marker='s', label="Фигура 100*200")

x = [10, 50, 100, 200]
y = [11782, 13678, 15274, 18627]

plt.plot(x, y, marker='d', label="Фигура 200*200")

x = [10, 50, 100, 200]
y = [35853, 39634, 44126, 50739]

plt.plot(x, y, marker='*', label="Фигура 400*200")

plt.legend()
plt.show()